import Functorio.AssemblyLine
import Functorio.Ascii

#guard (assemblyLine (recipe .advancedCircuit) 3).toAscii == s!"

 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑⚡***⚡↑↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑⚡***⚡↑↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑⚡***⚡↑↓
 ^^     ^v
"

#guard (bus do
  let acid <- input .sulfuricAcid (75/2)
  let green <- input .electronicCircuit 150
  let red <- input .advancedCircuit 15
  let _ <- busAssemblyLine (recipe .processingUnit) 1 acid.exact green red
).toAscii == s!"

  | ↑⇨***⇦↑↓
  |┤↑├*A*↠↑↓
  | ↑⚡***⚡↑↓
  |→↑     ↑↓
  |↑ →→→→→↑↓
  |↑ ↑↓←←←←←
  |↑ ↑↓
>||↑ ↑→→→→→→>
>→⇥↑↦↑
>→→↑

"

#guard (bus do
  let copper <- input .copperPlate 750
  let _ <- busAssemblyLine (recipe .copperCable) 5 copper
).toAscii == s!"

 ↑⇨***⇨↓
 ↑ *A* ↓
 ↑⚡***⚡↓
 ↑  ↓←*↓
 ↑↓←←↓S←
 ↑↓ ↑←→↓
 ↑→⇥⚡↦↑↓
 ↑⇨***⇨↓
 ↑ *A* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *A* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *A* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *A* ↓
 ↑⚡***⚡↓
 ↑←↓←←←←
  ↑↓
>→↑→→→→→>

"

#guard (bus do
  let _ <- input .copperPlate 4
  let water <- input .water 600
  let crude <- input .crudeOil 1200
  let _ <- busAssemblyLine (recipe .advancedOilProcessing) 1 water crude
).toAscii == s!"

  | | *****|| | |
  |┤|├***** | | |
  | |⚡**O**┤|├| |
  | ||***** | | |
  | | *****┤| |├|
  | | ||||||| | |
  | | |       | |
  | | | ||||||| |
  | | | |       |
  | | | |   |||||
  | | | |   |
>⇥| | | |↦→⇥|↦→→→→>
>|| | |┤|├|┤|├||||>
    |   |   |
>||||   |||┤|├||||>
            |
            ||||||>

"

#guard (bus do
  let nutrients <- input .nutrients 15
  let jellynut <- input .jellynut 120
  let _ <- busAssemblyLine (recipe .jellynutProcessing) 1 nutrients jellynut
).toAscii == s!"

 ***
 *H*
 ***
 ⇧⇧ ⚡
 ↑↑⇨***⇨↓↓
 ↑↑↠*B*↠↓↓
 ↑↑⚡***⚡↓↓
 ↑↑←↓←←←←↓
 ↑←↑↓ ↓←←←
  ↑↑↓ ↓
>→↑↑→⇥↓↦→→>
>→→↑  →→→→>

"

#guard (bus do
  let water <- input .water 360
  let nutrients <- input .nutrients 15
  let jelly <- input .jelly 360
  let bioflux <- input .bioflux 24
  let _ <- busAssemblyLine (recipe .rocketFuelFromJelly) 1 water nutrients jelly bioflux
).toAscii == s!"

    ***
    *H*
    ***
    ⇧⇧⇧⚡
    ↑↑↑←←←←←
  |┤↑↑├***⇦↑↓
  |⚡↑↑⇨*B*↠↑↓
  | ↑↑↠***⚡↑↓
  |→↑↑→→→→→↑↓
  |↑ ↑↑↓←←←←←
  |↑ ↑↑↓
>||↑ ↑↑→→→→→→>
>→⇥↑↦↑↑
>→→↑  ↑
>→→→→→↑

"

instance : Config where
  generateBigPoles := true
  generateRoboports := true
  providerChestCapacity := 3
  adapterMinHeight := 3

#guard (bus do
  let ice <- input .ice 60
  let _ <- busAssemblyLine (recipe .iceMelting) 1 ice
).toAscii == s!"

 ***┤↑├|
 *C*⇦↑ |
 ***⚡↑ |
 ****↑ |
 ****↑ |
 **R*↑ |
 ****↑ |
  ** ↑ |
  *↯ ↑ |
     ↑||
     ↑|
     ↑|
     ↑|
>→→→→↑|||>

"

#guard (bus do
  let ironOre <- input .ironOre 600
  let _ <- busAssemblyLine (recipe .ironPlate) 16 ironOre
).toAscii = s!"

 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑**** ↓
 ↑**** ↓
 ↑**R* ↓
 ↑****⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑⇨***⇨↓
 ↑ *F* ↓
 ↑⚡***⚡↓
 ↑**** ↓
 ↑**** ↓
 ↑**R* ↓
 ↑****⚡↓
 ↑     ↓
 ↑  ⚡🄿⇦↓
 ↑     ↓
 ↑ **  ↓
 ↑ *↯  ↓
 ↑ ↓←←←←
 ↑ ↓
 ↑←↓
  ↑↓
>→↑→→→→→>

"

#guard (bus do
  let stone <- input .stone 750
  let steel <- input .steelPlate 750
  let stick <- input .ironStick 750
  let _ <- busAssemblyLine (recipe .rail) 5 stone stick steel
).toAscii == s!"

 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑ ***↠↑↓
 ↑↑  ⚡  ↑↓
 ↑↑  ↓←*↥↓
 ↑↑↓←←↓S←←
 ↑↑↓ ↑←→→↓
 ↑↑→⇥⚡↦↑⤒↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑ ***↠↑↓
 ↑↑  ⚡  ↑↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑ ***↠↑↓
 ↑↑  ⚡  ↑↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑ ***↠↑↓
 ↑↑  ⚡  ↑↓
 ↑↑⇨***⇦↑↓
 ↑↑↠*A*↠↑↓
 ↑↑ ***↠↑↓
 ↑↑  ⚡  ↑↓
 ↑↑**** ↑↓
 ↑↑**** ↑↓
 ↑↑**R* ↑↓
 ↑↑****⚡↑↓
 ↑↑     ↥↓
 ↑↑  ⚡ 🄿⇦↓
 ↑↑     ⤒↓
 ↑↑ **  ↑↓
 ↑↑ *↯  ↑↓
 ↑↑  →→→↑↓
 ↑↑← ↑↓←←←
 ↑←↑ ↑↓
  ↑↑ ↑↓
>→↑↑ ↑→→→→>
>→⇥↑↦↑
>→→↑

"
